Show / Hide Table of Contents
Class ConcreteBlockData
Provides data of the single concrete block
Inheritance
System.Object
ConcreteBlockData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteBlockData
Properties
Improve this Doc   View Source
AxisX
LCS - Axis X
Declaration
public Vector3D AxisX { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
AxisY
LCS - Axis Y
Declaration
public Vector3D AxisY { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
AxisZ
LCS - Axis Z
Declaration
public Vector3D AxisZ { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
Center
Center of the concrete block LCS
Declaration
public Point3D Center { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
Depth
Depth of the concrete block
Declaration
public double Depth { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Id
Plate unique ID
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Material
Name of the material
Declaration
public string Material { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Name
Name of the concrete block
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Origin
Origin of the concrete block LCS
Declaration
public Point3D Origin { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
OriginalModelId
Get or set the identification in the original model In the case of the imported connection from another application
Declaration
public string OriginalModelId { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
OutlinePoints
Outline points
Declaration
public List<Point2D> OutlinePoints { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Point2D>
Improve this Doc   View Source
Region
Geometry of the concrete block in svg format
Declaration
public string Region { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source